### importing libraries and modules

In [1]:
import pandas as pd
import numpy as np
import psycopg2 # needed to get database exception errors when uploading dataframe
import requests # package for getting data from the web
from zipfile import * # package for unzipping zip files

In [2]:
# Import the get_engine function from our sql_functions.
from sql_functions import get_engine

### read in data: life expectancy

In [3]:
life_expectancy_df = pd.read_csv('data/life_expectancy.csv', low_memory = False)

### get overview

In [4]:
life_expectancy_df.head()

,Entity,Code,Year,Indicator:Life expectancy at birth (years) - Sex:Both sexes
0,Afghanistan,AFG,2000,54.98949
1,Afghanistan,AFG,2010,59.94055
2,Afghanistan,AFG,2015,61.65429
3,Afghanistan,AFG,2019,63.20990
4,Africa,NaN,2000,52.65365

In [5]:
life_expectancy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 776 entries, 0 to 775
Data columns (total 4 columns):
 #   Column                                                       Non-Null Count  Dtype
---  ------                                                       --------------  -----
 0   Entity                                                       776 non-null    object
 1   Code                                                         736 non-null    object
 2   Year                                                         776 non-null    int64
 3   Indicator:Life expectancy at birth (years) - Sex:Both sexes  776 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 24.4+ KB

In [6]:
736/4

184.0

In [7]:
life_expectancy_df.describe()

,Year,Indicator:Life expectancy at birth (years) - Sex:Both sexes
count,776.000000,776.000000
mean,2011.000000,70.211433
std,7.110918,8.576001
min,2000.000000,31.279200
25%,2007.500000,64.491197
50%,2012.500000,72.078110
75%,2016.000000,76.419915
max,2019.000000,84.261380

In [8]:
life_expectancy_df.Entity

0      Afghanistan
1      Afghanistan
2      Afghanistan
3      Afghanistan
4           Africa
          ...
771         Zambia
772       Zimbabwe
773       Zimbabwe
774       Zimbabwe
775       Zimbabwe
Name: Entity, Length: 776, dtype: object

## edit table: rename columns, drop "Code", round numbers

In [9]:
life_expectancy_df = life_expectancy_df.rename(columns={"Entity": "country", "Year": "year","Indicator:Life expectancy at birth (years) - Sex:Both sexes":"life_expectancy"})

In [10]:
life_expectancy_df = life_expectancy_df.drop("Code",axis=1)

In [11]:
life_expectancy_df = life_expectancy_df.round({'life_expectancy':1})

In [12]:
life_expectancy_df.head()

       country  year  life_expectancy
0  Afghanistan  2000             55.0
1  Afghanistan  2010             59.9
2  Afghanistan  2015             61.7
3  Afghanistan  2019             63.2
4       Africa  2000             52.7

In [13]:
life_expectancy_df["country"].nunique()

194

In [14]:
life_expectancy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 776 entries, 0 to 775
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   country          776 non-null    object
 1   year             776 non-null    int64
 2   life_expectancy  776 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 18.3+ KB

In [15]:
life_expectancy_df.dropna()

         country  year  life_expectancy
0    Afghanistan  2000             55.0
1    Afghanistan  2010             59.9
2    Afghanistan  2015             61.7
3    Afghanistan  2019             63.2
4         Africa  2000             52.7
..           ...   ...              ...
771       Zambia  2019             62.5
772     Zimbabwe  2000             46.6
773     Zimbabwe  2010             51.5
774     Zimbabwe  2015             58.5
775     Zimbabwe  2019             60.7

[776 rows x 3 columns]

In [16]:
life_expectancy_df.head()

       country  year  life_expectancy
0  Afghanistan  2000             55.0
1  Afghanistan  2010             59.9
2  Afghanistan  2015             61.7
3  Afghanistan  2019             63.2
4       Africa  2000             52.7

In [17]:
list_european_countries = ('Albania',
'Andorra',
'Belgium',
'Bosnia and Herzegovina',
'Bulgaria',
'Denmark',
'Germany',
'Estonia',
'Finland',
'France',
'Greece',
'Ireland',
'Iceland',
'Italy',
'Kazakhstan',
'Kosovo',
'Croatia',
'Latvia',
'Liechtenstein',
'Lithuania',
'Luxembourg',
'Malta',
'Moldova',
'Monaco',
'Montenegro',
'Netherlands',
'North Macedonia',
'Norway',
'Austria',
'Poland',
'Portugal',
'Romania',
'Russia',
'San Marino',
'Sweden',
'Switzerland',
'Serbia',
'Slovakia',
'Slovenia',
'Spain',
'Czech Republic',
'Turkey',
'Ukraine',
'Hungary',
'Vatican',
'United Kingdom',
'Belarus')

In [18]:
life_expectancy_df= life_expectancy_df.loc[life_expectancy_df.country.isin(list_european_countries)]

In [19]:
life_expectancy_df=life_expectancy_df.loc[life_expectancy_df.year.isin({2019})]

In [20]:
european_life_expectancy_df= life_expectancy_df.loc[life_expectancy_df.country.isin(list_european_countries)]

In [21]:
european_life_expectancy_df.head()

                   country  year  life_expectancy
11                 Albania  2019             78.0
43                 Austria  2019             81.6
67                 Belarus  2019             74.8
71                 Belgium  2019             81.4
91  Bosnia and Herzegovina  2019             76.8

In [84]:
european_life_expectancy_df.to_excel("european_life_expectancy.xlsx", sheet_name="european_life_expectancy")

## new dataframe: maternal deaths

In [22]:
maternal_deaths_df = pd.read_csv('data/maternal_deaths.csv', low_memory = False)

In [23]:
maternal_deaths_df.head()

,Entity,Code,Year,Maternal Mortality Ratio (Gapminder (2010) and World Bank (2015)),"GDP per capita, PPP (constant 2017 international $)",Population (historical estimates),Continent
0,Abkhazia,OWID_ABK,2015,NaN,NaN,NaN,Asia
1,Afghanistan,AFG,2000,1450.0,NaN,19542986.0,NaN
2,Afghanistan,AFG,2001,1390.0,NaN,19688634.0,NaN
3,Afghanistan,AFG,2002,1300.0,1189.784668,21000258.0,NaN
4,Afghanistan,AFG,2003,1240.0,1235.810059,22645136.0,NaN

In [24]:
maternal_deaths_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57964 entries, 0 to 57963
Data columns (total 7 columns):
 #   Column                                                             Non-Null Count  Dtype
---  ------                                                             --------------  -----
 0   Entity                                                             57964 non-null  object
 1   Code                                                               54388 non-null  object
 2   Year                                                               57964 non-null  int64
 3   Maternal Mortality Ratio (Gapminder (2010) and World Bank (2015))  5800 non-null   float64
 4   GDP per capita, PPP (constant 2017 international $)                6166 non-null   float64
 5   Population (historical estimates)                                  57172 non-null  float64
 6   Continent                                                          285 non-null    object
dtypes: float64(3), int64(1), object(3)
memory usage: 3.1+ MB

In [25]:
#life_expectancy_df = life_expectancy_df.drop("Code",axis=1)
maternal_deaths_df = maternal_deaths_df.drop(["Code","Continent"],axis=1)

In [26]:
maternal_deaths_df.head()

,Entity,Year,Maternal Mortality Ratio (Gapminder (2010) and World Bank (2015)),"GDP per capita, PPP (constant 2017 international $)",Population (historical estimates)
0,Abkhazia,2015,NaN,NaN,NaN
1,Afghanistan,2000,1450.0,NaN,19542986.0
2,Afghanistan,2001,1390.0,NaN,19688634.0
3,Afghanistan,2002,1300.0,1189.784668,21000258.0
4,Afghanistan,2003,1240.0,1235.810059,22645136.0

In [27]:
maternal_deaths_df.describe()

,Year,Maternal Mortality Ratio (Gapminder (2010) and World Bank (2015)),"GDP per capita, PPP (constant 2017 international $)",Population (historical estimates)
count,57964.000000,5800.000000,6166.000000,5.717200e+04
mean,1601.738786,216.928822,17879.286262,4.323185e+07
std,1428.491685,297.109363,20132.683171,2.717687e+08
min,-10000.000000,0.000000,436.720367,0.000000e+00
25%,1832.000000,13.000000,3678.829102,1.390905e+05
50%,1901.000000,61.185000,10365.778320,1.312710e+06
75%,1966.000000,356.000000,25832.031738,6.061807e+06
max,2021.000000,2480.000000,161971.468750,7.909295e+09

In [28]:
maternal_deaths_df = maternal_deaths_df.rename(columns={"Entity":"country","Year":"year","Maternal Mortality Ratio (Gapminder (2010) and World Bank (2015))":"deaths_per_100,000_live_births","GDP per capita, PPP (constant 2017 international $)":"gdp_per_capita","Population (historical estimates)":"population"})

In [29]:
maternal_deaths_df.head(30)

,country,year,"deaths_per_100,000_live_births",gdp_per_capita,population
0,Abkhazia,2015,NaN,NaN,NaN
1,Afghanistan,2000,1450.0,NaN,19542986.0
2,Afghanistan,2001,1390.0,NaN,19688634.0
3,Afghanistan,2002,1300.0,1189.784668,21000258.0
4,Afghanistan,2003,1240.0,1235.810059,22645136.0
5,Afghanistan,2004,1180.0,1200.277954,23553554.0
6,Afghanistan,2005,1140.0,1286.793701,24411196.0
7,Afghanistan,2006,1120.0,1315.789062,25442946.0
8,Afghanistan,2007,1090.0,1460.825806,25903306.0
9,Afghanistan,2008,1030.0,1484.114502,26427204.0
10,Afghanistan,2009,993.0,1758.904419,27385310.0
11,Afghanistan,2010,954.0,1957.029053,28189672.0
12,Afghanistan,2011,905.0,1904.559937,29249156.0
13,Afghanistan,2012,858.0,2075.491699,30466484.0
14,Afghanistan,2013,810.0,2116.465332,31541216.0
15,Afghanistan,2014,786.0,2102.384521,32716214.0
16,Afghanistan,2015,701.0,2068.265869,33753500.0
17,Afghanistan,2016,673.0,2057.067871,34636212.0
18,Afghanistan,2017,638.0,2058.400146,35643420.0
19,Afghanistan,2018,NaN,2033.804443,36686788.0
20,Afghanistan,2019,NaN,2065.036133,37769496.0
21,Afghanistan,2020,NaN,1970.560181,38972236.0
22,Afghanistan,-10000,NaN,NaN,14737.0
23,Afghanistan,-9000,NaN,NaN,20405.0
24,Afghanistan,-8000,NaN,NaN,28253.0
25,Afghanistan,-7000,NaN,NaN,39120.0
26,Afghanistan,-6000,NaN,NaN,54166.0
27,Afghanistan,-5000,NaN,NaN,74999.0
28,Afghanistan,-4000,NaN,NaN,306250.0
29,Afghanistan,-3000,NaN,NaN,537500.0

In [30]:
maternal_deaths_df["year"].max()

2021

In [31]:
maternal_deaths_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57964 entries, 0 to 57963
Data columns (total 5 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   country                         57964 non-null  object
 1   year                            57964 non-null  int64
 2   deaths_per_100,000_live_births  5800 non-null   float64
 3   gdp_per_capita                  6166 non-null   float64
 4   population                      57172 non-null  float64
dtypes: float64(3), int64(1), object(1)
memory usage: 2.2+ MB

In [32]:
maternal_deaths_df.dropna()

,country,year,"deaths_per_100,000_live_births",gdp_per_capita,population
3,Afghanistan,2002,1300.0,1189.784668,21000258.0
4,Afghanistan,2003,1240.0,1235.810059,22645136.0
5,Afghanistan,2004,1180.0,1200.277954,23553554.0
6,Afghanistan,2005,1140.0,1286.793701,24411196.0
7,Afghanistan,2006,1120.0,1315.789062,25442946.0
...,...,...,...,...,...
57717,Zimbabwe,2013,509.0,3681.947266,13555420.0
57718,Zimbabwe,2014,494.0,3703.897217,13855758.0
57719,Zimbabwe,2015,480.0,3707.622559,14154937.0
57720,Zimbabwe,2016,468.0,3678.217041,14452705.0
57721,Zimbabwe,2017,458.0,3795.642334,14751101.0

In [33]:
maternal_deaths_df.head(30)

,country,year,"deaths_per_100,000_live_births",gdp_per_capita,population
0,Abkhazia,2015,NaN,NaN,NaN
1,Afghanistan,2000,1450.0,NaN,19542986.0
2,Afghanistan,2001,1390.0,NaN,19688634.0
3,Afghanistan,2002,1300.0,1189.784668,21000258.0
4,Afghanistan,2003,1240.0,1235.810059,22645136.0
5,Afghanistan,2004,1180.0,1200.277954,23553554.0
6,Afghanistan,2005,1140.0,1286.793701,24411196.0
7,Afghanistan,2006,1120.0,1315.789062,25442946.0
8,Afghanistan,2007,1090.0,1460.825806,25903306.0
9,Afghanistan,2008,1030.0,1484.114502,26427204.0
10,Afghanistan,2009,993.0,1758.904419,27385310.0
11,Afghanistan,2010,954.0,1957.029053,28189672.0
12,Afghanistan,2011,905.0,1904.559937,29249156.0
13,Afghanistan,2012,858.0,2075.491699,30466484.0
14,Afghanistan,2013,810.0,2116.465332,31541216.0
15,Afghanistan,2014,786.0,2102.384521,32716214.0
16,Afghanistan,2015,701.0,2068.265869,33753500.0
17,Afghanistan,2016,673.0,2057.067871,34636212.0
18,Afghanistan,2017,638.0,2058.400146,35643420.0
19,Afghanistan,2018,NaN,2033.804443,36686788.0
20,Afghanistan,2019,NaN,2065.036133,37769496.0
21,Afghanistan,2020,NaN,1970.560181,38972236.0
22,Afghanistan,-10000,NaN,NaN,14737.0
23,Afghanistan,-9000,NaN,NaN,20405.0
24,Afghanistan,-8000,NaN,NaN,28253.0
25,Afghanistan,-7000,NaN,NaN,39120.0
26,Afghanistan,-6000,NaN,NaN,54166.0
27,Afghanistan,-5000,NaN,NaN,74999.0
28,Afghanistan,-4000,NaN,NaN,306250.0
29,Afghanistan,-3000,NaN,NaN,537500.0

In [34]:
maternal_deaths_df.dropna()

,country,year,"deaths_per_100,000_live_births",gdp_per_capita,population
3,Afghanistan,2002,1300.0,1189.784668,21000258.0
4,Afghanistan,2003,1240.0,1235.810059,22645136.0
5,Afghanistan,2004,1180.0,1200.277954,23553554.0
6,Afghanistan,2005,1140.0,1286.793701,24411196.0
7,Afghanistan,2006,1120.0,1315.789062,25442946.0
...,...,...,...,...,...
57717,Zimbabwe,2013,509.0,3681.947266,13555420.0
57718,Zimbabwe,2014,494.0,3703.897217,13855758.0
57719,Zimbabwe,2015,480.0,3707.622559,14154937.0
57720,Zimbabwe,2016,468.0,3678.217041,14452705.0
57721,Zimbabwe,2017,458.0,3795.642334,14751101.0

In [35]:
maternal_deaths_df.loc[maternal_deaths_df['year'].isin({2016})]

,country,year,"deaths_per_100,000_live_births",gdp_per_capita,population
17,Afghanistan,2016,673.0,2057.067871,3.463621e+07
513,Africa,2016,NaN,NaN,1.232112e+09
536,Albania,2016,16.0,12291.859375,2.881064e+06
795,Algeria,2016,113.0,11826.151367,4.033933e+07
1146,American Samoa,2016,NaN,NaN,5.046800e+04
...,...,...,...,...,...
56916,Western Sahara,2016,NaN,NaN,5.054610e+05
56938,World,2016,214.0,15803.528320,7.513474e+09
57198,Yemen,2016,165.0,NaN,2.927401e+07
57460,Zambia,2016,222.0,3467.887451,1.676776e+07
57720,Zimbabwe,2016,468.0,3678.217041,1.445270e+07

In [36]:
maternal_deaths_df = maternal_deaths_df.loc[maternal_deaths_df['country'].isin(list_european_countries)]

In [37]:
maternal_deaths_df = maternal_deaths_df.loc[maternal_deaths_df['year'].isin({2016})]

In [38]:
maternal_deaths_df = maternal_deaths_df.dropna()

In [39]:
european_maternal_deaths_df = maternal_deaths_df.loc[maternal_deaths_df['country'].isin(list_european_countries)]

In [40]:
european_maternal_deaths_df.head()

,country,year,"deaths_per_100,000_live_births",gdp_per_capita,population
536,Albania,2016,16.0,12291.859375,2881064.0
3256,Austria,2016,5.7,53345.742188,8736491.0
4769,Belarus,2016,3.0,17883.126953,9708111.0
5158,Belgium,2016,4.1,49829.925781,11316837.0
6467,Bosnia and Herzegovina,2016,10.0,13194.331055,3480985.0

In [85]:
european_maternal_deaths_df.to_excel("european_maternal_deaths.xlsx", sheet_name="european_maternal_deaths")

## drop null values? filter to certain years/countries?

## new data: child mortality

In [41]:
child_mortality_df = pd.read_csv('data/child_mortality.csv', low_memory = False)

In [42]:
child_mortality_df.head()

,Entity,Code,Year,Child mortality rate - Sex: all - Age: 0-4 - Variant: estimates
0,Afghanistan,AFG,1950,41.940210
1,Afghanistan,AFG,1951,41.630490
2,Afghanistan,AFG,1952,40.986248
3,Afghanistan,AFG,1953,40.335840
4,Afghanistan,AFG,1954,39.781000

In [43]:
child_mortality_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18360 entries, 0 to 18359
Data columns (total 4 columns):
 #   Column                                                           Non-Null Count  Dtype
---  ------                                                           --------------  -----
 0   Entity                                                           18360 non-null  object
 1   Code                                                             17064 non-null  object
 2   Year                                                             18360 non-null  int64
 3   Child mortality rate - Sex: all - Age: 0-4 - Variant: estimates  18360 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 573.9+ KB

In [44]:
child_mortality_df.describe()

,Year,Child mortality rate - Sex: all - Age: 0-4 - Variant: estimates
count,18360.000000,18360.000000
mean,1985.500000,8.707520
std,20.783171,8.961521
min,1950.000000,0.146230
25%,1967.750000,1.915498
50%,1985.500000,5.062305
75%,2003.250000,12.893562
max,2021.000000,65.933380

In [45]:
child_mortality_df = child_mortality_df.drop("Code",axis=1)

In [46]:
child_mortality_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18360 entries, 0 to 18359
Data columns (total 3 columns):
 #   Column                                                           Non-Null Count  Dtype
---  ------                                                           --------------  -----
 0   Entity                                                           18360 non-null  object
 1   Year                                                             18360 non-null  int64
 2   Child mortality rate - Sex: all - Age: 0-4 - Variant: estimates  18360 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 430.4+ KB

In [47]:
child_mortality_df = child_mortality_df.rename(columns={"Entity":"country","Year":"year","Child mortality rate - Sex: all - Age: 0-4 - Variant: estimates":"deaths"})

In [48]:
child_mortality_df = child_mortality_df.round({"deaths":2})

In [49]:
child_mortality_df.head()

       country  year  deaths
0  Afghanistan  1950   41.94
1  Afghanistan  1951   41.63
2  Afghanistan  1952   40.99
3  Afghanistan  1953   40.34
4  Afghanistan  1954   39.78

In [50]:
child_mortality_df["country"].nunique()

255

In [51]:
child_mortality_df.dropna()

           country  year  deaths
0      Afghanistan  1950   41.94
1      Afghanistan  1951   41.63
2      Afghanistan  1952   40.99
3      Afghanistan  1953   40.34
4      Afghanistan  1954   39.78
...            ...   ...     ...
18355     Zimbabwe  2017    5.57
18356     Zimbabwe  2018    5.32
18357     Zimbabwe  2019    5.31
18358     Zimbabwe  2020    5.23
18359     Zimbabwe  2021    5.21

[18360 rows x 3 columns]

In [52]:
child_mortality_df = child_mortality_df.loc[child_mortality_df.country.isin(list_european_countries)]

In [53]:
child_mortality_df = child_mortality_df.loc[child_mortality_df.year.isin({2021})]

In [54]:
european_child_mortality_df = child_mortality_df.loc[child_mortality_df.country.isin(list_european_countries)]

In [55]:
european_child_mortality_df.head()

      country  year  deaths
215   Albania  2021    1.00
431   Andorra  2021    0.67
1079  Austria  2021    0.36
1511  Belarus  2021    0.27
1583  Belgium  2021    0.40

In [86]:
european_child_mortality_df.to_excel("european_child_mortality.xlsx", sheet_name="european_child_mortality")

## new data: crime index

In [56]:
crime_index_df = pd.read_csv('data/world_crime_index.csv', low_memory = False)

In [57]:
crime_index_df.tail(20)

     Rank                             City  Crime Index  Safety Index
433   434           Groningen, Netherlands        20.80         79.20
434   435                   Tartu, Estonia        20.70         79.30
435   436                   Arhus, Denmark        20.60         79.40
436   437                     Muscat, Oman        20.54         79.46
437   438               Basel, Switzerland        20.12         79.88
438   439                  Oradea, Romania        19.82         80.18
439   440              Lugano, Switzerland        19.48         80.52
440   441                Trondheim, Norway        19.41         80.59
441   442                Eskisehir, Turkey        18.86         81.14
442   443                  Munich, Germany        18.66         81.34
443   444                Bern, Switzerland        17.94         82.06
444   445              Zurich, Switzerland        17.26         82.74
445   446      Dubai, United Arab Emirates        16.30         83.70
446   447    Sharjah, United Arab Emirates        15.69         84.31
447   448      Ajman, United Arab Emirates        15.64         84.36
448   449              Quebec City, Canada        15.14         84.86
449   450                   Taipei, Taiwan        15.05         84.95
450   451             San Sebastian, Spain        14.86         85.14
451   452                      Doha, Qatar        13.96         86.04
452   453  Abu Dhabi, United Arab Emirates        11.67         88.33

In [58]:
crime_index_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 453 entries, 0 to 452
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          453 non-null    int64
 1   City          453 non-null    object
 2   Crime Index   453 non-null    float64
 3   Safety Index  453 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 14.3+ KB

In [59]:
crime_index_df.head()

   Rank                            City  Crime Index  Safety Index
0     1              Caracas, Venezuela        83.98         16.02
1     2          Pretoria, South Africa        81.98         18.02
2     3                  Celaya, Mexico        81.80         18.20
3     4        San Pedro Sula, Honduras        80.87         19.13
4     5  Port Moresby, Papua New Guinea        80.71         19.29

In [60]:
crime_index_df2 = crime_index_df.copy()
# #str(df2.columns).lower()
cols = crime_index_df2.columns.tolist()
cols = [col.lower() for col in cols]
cols = [col.replace(' ', '_') for col in cols]
# cols = [col.replace("#","num") for col in cols]

crime_index_df2.columns = cols
cols
crime_index_df2

     rank                             city  crime_index  safety_index
0       1               Caracas, Venezuela        83.98         16.02
1       2           Pretoria, South Africa        81.98         18.02
2       3                   Celaya, Mexico        81.80         18.20
3       4         San Pedro Sula, Honduras        80.87         19.13
4       5   Port Moresby, Papua New Guinea        80.71         19.29
..    ...                              ...          ...           ...
448   449              Quebec City, Canada        15.14         84.86
449   450                   Taipei, Taiwan        15.05         84.95
450   451             San Sebastian, Spain        14.86         85.14
451   452                      Doha, Qatar        13.96         86.04
452   453  Abu Dhabi, United Arab Emirates        11.67         88.33

[453 rows x 4 columns]

In [61]:
crime_index_df2.city.values

array(['Caracas, Venezuela', 'Pretoria, South Africa', 'Celaya, Mexico',
       'San Pedro Sula, Honduras', 'Port Moresby, Papua New Guinea',
       'Durban, South Africa', 'Johannesburg, South Africa',
       'Kabul, Afghanistan', 'Rio de Janeiro, Brazil', 'Natal, Brazil',
       'Fortaleza, Brazil', 'Port Elizabeth, South Africa',
       'Recife, Brazil', 'Port of Spain, Trinidad And Tobago',
       'Baltimore, MD, United States', 'Salvador, Brazil',
       'Rosario, Argentina', 'Memphis, TN, United States',
       'Detroit, MI, United States', 'Rockhampton, Australia',
       'Cape Town, South Africa', 'Porto Alegre, Brazil',
       'Tijuana, Mexico', 'Kingston, Jamaica',
       'Bloemfontein, South Africa', 'Bradford, United Kingdom',
       'Albuquerque, NM, United States', 'Lima, Peru',
       'Guayaquil, Ecuador', 'Sao Paulo, Brazil',
       'Saint Louis, MO, United States', 'San Salvador, El Salvador',
       'Cali, Colombia', 'Mexico City, Mexico', 'Windhoek, Namibia',
       'San Juan, Puerto Rico', 'Santo Domingo, Dominican Republic',
       'Coventry, United Kingdom', 'Damascus, Syria', 'Luanda, Angola',
       'New Orleans, LA, United States', 'Milwaukee, WI, United States',
       'Campinas, Brazil', 'Oakland, CA, United States', 'Lagos, Nigeria',
       'Chicago, IL, United States', 'Nantes, France', 'Bogota, Colombia',
       'Manila, Philippines', 'Surrey, Canada',
       'Cleveland, OH, United States', 'Houston, TX, United States',
       'Almaty, Kazakhstan', 'Male, Maldives', 'Lethbridge, AB, Canada',
       'Dhaka, Bangladesh', 'Philadelphia, PA, United States',
       'Belo Horizonte, Brazil', 'Catania, Italy',
       'Kuala Lumpur, Malaysia', 'Buenos Aires, Argentina',
       'Klang, Malaysia', 'Atlanta, GA, United States',
       'Birmingham, United Kingdom', 'Guatemala City, Guatemala',
       'Marseille, France', 'Tripoli, Libya',
       'Anchorage, AK, United States', 'Curitiba, Brazil',
       'Guadalajara, Mexico', 'Red Deer, Canada', 'Kelowna, Canada',
       'Quezon City, Philippines', 'Quito, Ecuador', 'Puebla, Mexico',
       'Cairns, Australia', 'Cordoba, Argentina', 'Harare, Zimbabwe',
       'Craiova, Romania', 'San Francisco, CA, United States',
       'Sudbury, Canada', 'Naples, Italy', 'Dar es Salaam, Tanzania',
       'Ghaziabad, India', 'Sault Ste. Marie, Canada', 'Santiago, Chile',
       'Brasilia, Brazil', 'Nice, France',
       'Washington, DC, United States', 'Delhi, India', 'Baghdad, Iraq',
       'Nairobi, Kenya', 'Winnipeg, Canada', 'Minsk, Belarus',
       'Darwin, Australia', 'Indianapolis, IN, United States',
       'Kansas City, MO, United States', 'Liege, Belgium', 'Noida, India',
       'Jacksonville, FL, United States', 'Malmo, Sweden',
       'Athens, Greece', 'Louisville, KY, United States', 'Paris, France',
       'Manchester, United Kingdom', 'Geelong, Australia', 'Tehran, Iran',
       'Gaborone, Botswana', 'Casablanca, Morocco',
       'San Jose, Costa Rica', 'Ulaanbaatar, Mongolia', 'Cancun, Mexico',
       'Montpellier, France', 'Minneapolis, MN, United States',
       'Gurgaon, India', 'Oshawa, Canada', 'Spokane, WA, United States',
       'Ballarat, Australia', 'Brampton, Canada',
       'Las Vegas, NV, United States', 'Montevideo, Uruguay',
       'Bangalore, India', 'Thessaloniki, Greece', 'Hamilton, Canada',
       'Bilbao, Spain', 'Lille, France', 'Grenoble, France',
       'Karachi, Pakistan', 'Johor Bahru, Malaysia', 'Algiers, Algeria',
       'Ho Chi Minh City, Vietnam', 'London, Canada',
       'Phnom Penh, Cambodia', 'Jakarta, Indonesia',
       'London, United Kingdom', 'Toowoomba, Australia',
       'Odessa (Odesa), Ukraine', 'Medellin, Colombia', 'Rome, Italy',
       'Rennes, France', 'Petaling Jaya, Malaysia', 'Amadora, Portugal',
       'Drogheda, Ireland', 'Portland, OR, United States',
       'Regina, Canada', 'Kamloops, Canada', 'Brussels, Belgium',
       'Dnipro, Ukraine', 'Rostov-na-donu, Russia',
       'Miami, FL, United States', 'Phoenix, AZ, United States',
       'Bari, Italy', 'Dublin, Ireland', 'Cebu, Philippines',
       'Wollongong, Australia', 'Florianopolis, Brazil',
       'Orlando, FL, United States', 'Ufa, Russia',
       'San Miguel de Allende, Mexico', 'Seattle, WA, United States',
       'Lyon, France', 'Turin, Italy', 'Nottingham, United Kingdom',
       'Los Angeles, CA, United States', 'Dallas, TX, United States',
       'Tucson, AZ, United States', 'Cairo, Egypt',
       'Playa del Carmen, Mexico', 'Constanta, Romania',
       'Asuncion, Paraguay', 'Nanaimo, BC, Canada', 'Toulouse, France',
       'Barcelona, Spain', 'Mysore, India', 'Saskatoon, Canada',
       'Kharkiv, Ukraine', 'Liverpool, United Kingdom', 'Indore, India',
       'Sacramento, CA, United States', 'Rawalpindi, Pakistan',
       'Lucknow (Lakhnau), India', 'Bordeaux, France',
       'Cincinnati, OH, United States', 'Bali, Indonesia',
       'San Antonio, TX, United States', 'New York, NY, United States',
       'Richmond, VA, United States', 'Istanbul, Turkey',
       'Tampa, FL, United States', 'St.Catharines, Canada',
       'Gothenburg, Sweden', 'Monterrey, Mexico', 'Podgorica, Montenegro',
       'Panama City, Panama', 'Addis Ababa, Ethiopia', 'Tunis, Tunisia',
       'Yekaterinburg, Russia',
       "St. John's, Newfoundland and Labrador, Canada",
       'Novosibirsk, Russia', 'Accra, Ghana', 'Milan, Italy',
       'Nashville, TN, United States', 'Omaha, NE, United States',
       'Skopje, North Macedonia', 'Auckland, New Zealand',
       'Kolkata, India', 'Beirut, Lebanon', 'Bologna, Italy',
       'Newcastle, Australia', 'Palermo, Italy', 'Hamilton, New Zealand',
       'Pattaya, Thailand', 'Buffalo, NY, United States',
       'Honolulu, HI, United States', 'Gold Coast, Australia',
       'Stockholm, Sweden', 'Glasgow, United Kingdom',
       'San Jose, CA, United States', 'Charlotte, NC, United States',
       'Vitoria, Brazil', 'Kiev (Kyiv), Ukraine', 'Kuching, Malaysia',
       'Mumbai, India', 'Sarajevo, Bosnia And Herzegovina',
       'Moncton, Canada', 'Belfast, United Kingdom',
       'Denver, CO, United States', 'Chisinau, Moldova',
       'Edmonton, Canada', 'Tirana, Albania', 'Melbourne, Australia',
       'Frankfurt, Germany', 'Kristiansand, Norway',
       'Columbus, OH, United States', 'Hyderabad, India',
       'Sheffield, United Kingdom', 'Chandigarh, India',
       'Leeds, United Kingdom', 'Windsor, Canada', 'Mississauga, Canada',
       'Vaughan, Canada', 'Cologne, Germany', 'Hamburg, Germany',
       'Genoa, Italy', 'Berlin, Germany', 'Sofia, Bulgaria',
       'Lodz, Poland', 'Bristol, United Kingdom', 'Perth, Australia',
       'Pune, India', 'Bremen, Germany', 'Toronto, Canada',
       'Novi Sad, Serbia', 'Iloilo, Philippines', 'Cuenca, Ecuador',
       'Hanover, Germany', 'Katowice, Poland', 'Kochi, India',
       'Colombo, Sri Lanka', 'Halifax, Canada',
       'Christchurch, New Zealand', 'Bangkok, Thailand',
       'Kitchener, Canada', 'Leipzig, Germany',
       'Brooklyn, NY, United States', 'Uppsala, Sweden', 'Chennai, India',
       'Bonn, Germany', 'Limerick, Ireland', 'Alexandria, Egypt',
       'Florence, Italy', 'Thiruvananthapuram, India',
       'Coimbatore, India', 'Saint Petersburg, Russia', 'Ankara, Turkey',
       'Boston, MA, United States', 'Newcastle upon Tyne, United Kingdom',
       'Riverside, CA, United States', 'Lviv, Ukraine', 'Amman, Jordan',
       'Makati, Philippines', 'Vancouver, Canada',
       'Pittsburgh, PA, United States', 'Hanoi, Vietnam',
       'Karlsruhe, Germany', 'Victoria, Canada', 'Belgrade, Serbia',
       'Strasbourg, France', 'Riga, Latvia', 'Visakhapatnam, India',
       'Kaunas, Lithuania', 'Antwerp, Belgium', 'Cardiff, United Kingdom',
       'Kathmandu, Nepal', 'Moscow, Russia', 'Austin, TX, United States',
       'Baguio, Philippines', 'San Diego, CA, United States',
       'Varna, Bulgaria', 'Calgary, Canada', 'Nagpur, India',
       'Queretaro, Mexico', 'Oulu, Finland', 'Brighton, United Kingdom',
       'Klaipeda, Lithuania', 'Guangzhou, China', 'Cagliari, Italy',
       'Jerusalem, Israel', 'Rabat, Morocco', 'Rotterdam, Netherlands',
       'Cork, Ireland', 'Lahore, Pakistan', 'Boise, ID, United States',
       'Penang, Malaysia', 'Surat, India', 'Jaipur, India',
       'Porto, Portugal', 'Budapest, Hungary', 'Brisbane, Australia',
       'Banja Luka, Bosnia And Herzegovina', 'Raleigh, NC, United States',
       'Puerto Vallarta, Mexico', 'Navi Mumbai, India',
       'Kingston, Canada', 'Dusseldorf, Germany', 'Oslo, Norway',
       'Madison, WI, United States', 'Lund, Sweden',
       'Tashkent, Uzbekistan', 'Sydney, Australia',
       'Aguascalientes, Mexico', 'Aberdeen, United Kingdom',
       'Iasi, Romania', 'Split, Croatia', 'Nuremberg, Germany',
       'Shanghai, China', 'Guelph, Canada',
       'Astana (Nur-Sultan), Kazakhstan',
       'Salt Lake City, UT, United States', 'Amsterdam, Netherlands',
       'Vadodara, India', 'El Paso, TX, United States', 'Beijing, China',
       'Ahmedabad, India', 'Osaka, Japan', 'Palma de Mallorca, Spain',
       'Hobart, Australia', 'Limassol, Cyprus', 'Shenzhen, China',
       'Seville (Sevilla), Spain', 'Freiburg im Breisgau, Germany',
       'Gdansk, Poland', 'Havana, Cuba', 'Montreal, Canada',
       'Izmir, Turkey', 'Wroclaw, Poland', 'Stuttgart, Germany',
       'Dresden, Germany', 'Wellington, New Zealand', 'Poznan, Poland',
       'Kuwait City, Kuwait', 'Edinburgh, United Kingdom',
       'Baku, Azerbaijan', 'Ad Dammam, Saudi Arabia',
       'Krakow (Cracow), Poland', 'Luxembourg, Luxembourg',
       'Madrid, Spain', 'Burlington, Canada', 'Adelaide, Australia',
       'Bratislava, Slovakia', 'Nicosia, Cyprus',
       'Cambridge, United Kingdom', 'Islamabad, Pakistan',
       'Nizhny Novgorod, Russia', 'Galway, Ireland', 'Lisbon, Portugal',
       'Jeddah (Jiddah), Saudi Arabia', 'Alicante, Spain',
       'Bucharest, Romania', 'Bursa, Turkey', 'Davao, Philippines',
       'Valencia, Spain', 'Graz, Austria', 'Warsaw, Poland',
       'Ottawa, Canada', 'Singapore, Singapore', 'Bergen, Norway',
       'Malaga, Spain', 'Antalya, Turkey', 'Haifa, Israel',
       'Vienna, Austria', 'Utrecht, Netherlands', 'Copenhagen, Denmark',
       'Tel Aviv-Yafo, Israel', 'Geneva, Switzerland',
       'Vilnius, Lithuania', 'Brasov, Romania', 'Riyadh, Saudi Arabia',
       'Richmond Hill, Canada', 'Gent, Belgium', 'Trieste, Italy',
       'Brno, Czech Republic', 'Oakville, Canada', 'Aalborg, Denmark',
       'Lausanne, Switzerland', 'Seoul, South Korea', 'Tbilisi, Georgia',
       'Markham, Canada', 'Mangalore, India', 'Merida, Mexico',
       'Helsinki, Finland', 'Eindhoven, Netherlands', 'Kigali, Rwanda',
       'Prague, Czech Republic', 'Timisoara, Romania',
       'Chiang Mai, Thailand', 'Tokyo, Japan', 'Tallinn, Estonia',
       'Rijeka, Croatia', 'Stavanger, Norway', 'Reykjavik, Iceland',
       'Amarillo, TX, United States', 'Coquitlam, Canada',
       'Canberra, Australia', 'The Hague (Den Haag), Netherlands',
       'Cluj-Napoca, Romania', 'Tampere, Finland', 'Yerevan, Armenia',
       'Hong Kong, Hong Kong', 'Ljubljana, Slovenia', 'Zagreb, Croatia',
       'Manama, Bahrain', 'Irvine, CA, United States',
       'Groningen, Netherlands', 'Tartu, Estonia', 'Arhus, Denmark',
       'Muscat, Oman', 'Basel, Switzerland', 'Oradea, Romania',
       'Lugano, Switzerland', 'Trondheim, Norway', 'Eskisehir, Turkey',
       'Munich, Germany', 'Bern, Switzerland', 'Zurich, Switzerland',
       'Dubai, United Arab Emirates', 'Sharjah, United Arab Emirates',
       'Ajman, United Arab Emirates', 'Quebec City, Canada',
       'Taipei, Taiwan', 'San Sebastian, Spain', 'Doha, Qatar',
       'Abu Dhabi, United Arab Emirates'], dtype=object)

In [62]:
type(crime_index_df2)

pandas.core.frame.DataFrame

In [63]:
crime_index_df2.head(20)

    rank                                city  crime_index  safety_index
0      1                  Caracas, Venezuela        83.98         16.02
1      2              Pretoria, South Africa        81.98         18.02
2      3                      Celaya, Mexico        81.80         18.20
3      4            San Pedro Sula, Honduras        80.87         19.13
4      5      Port Moresby, Papua New Guinea        80.71         19.29
5      6                Durban, South Africa        80.60         19.40
6      7          Johannesburg, South Africa        80.55         19.45
7      8                  Kabul, Afghanistan        79.39         20.61
8      9              Rio de Janeiro, Brazil        77.93         22.07
9     10                       Natal, Brazil        77.69         22.31
10    11                   Fortaleza, Brazil        77.36         22.64
11    12        Port Elizabeth, South Africa        76.44         23.56
12    13                      Recife, Brazil        76.42         23.58
13    14  Port of Spain, Trinidad And Tobago        76.21         23.79
14    15        Baltimore, MD, United States        75.75         24.25
15    16                    Salvador, Brazil        75.69         24.31
16    17                  Rosario, Argentina        75.11         24.89
17    18          Memphis, TN, United States        74.76         25.24
18    19          Detroit, MI, United States        74.63         25.37
19    20              Rockhampton, Australia        73.51         26.49

In [64]:
crime_index_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 453 entries, 0 to 452
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rank          453 non-null    int64
 1   city          453 non-null    object
 2   crime_index   453 non-null    float64
 3   safety_index  453 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 14.3+ KB

In [65]:
city2 = crime_index_df2['city'].str.split(',').str[0]

country = crime_index_df2['city'].str.split(', ').str[-1]

In [66]:
type(country)

pandas.core.series.Series

In [67]:
crime_index_df2.insert(1, "city2", city2, True)

In [68]:
crime_index_df2.insert(2, "country", country, True)

In [69]:
crime_index_df2.head(20)

,rank,city2,country,city,crime_index,safety_index
0,1,Caracas,Venezuela,"Caracas, Venezuela",83.98,16.02
1,2,Pretoria,South Africa,"Pretoria, South Africa",81.98,18.02
2,3,Celaya,Mexico,"Celaya, Mexico",81.80,18.20
3,4,San Pedro Sula,Honduras,"San Pedro Sula, Honduras",80.87,19.13
4,5,Port Moresby,Papua New Guinea,"Port Moresby, Papua New Guinea",80.71,19.29
5,6,Durban,South Africa,"Durban, South Africa",80.60,19.40
6,7,Johannesburg,South Africa,"Johannesburg, South Africa",80.55,19.45
7,8,Kabul,Afghanistan,"Kabul, Afghanistan",79.39,20.61
8,9,Rio de Janeiro,Brazil,"Rio de Janeiro, Brazil",77.93,22.07
9,10,Natal,Brazil,"Natal, Brazil",77.69,22.31
10,11,Fortaleza,Brazil,"Fortaleza, Brazil",77.36,22.64
11,12,Port Elizabeth,South Africa,"Port Elizabeth, South Africa",76.44,23.56
12,13,Recife,Brazil,"Recife, Brazil",76.42,23.58
13,14,Port of Spain,Trinidad And Tobago,"Port of Spain, Trinidad And Tobago",76.21,23.79
14,15,Baltimore,United States,"Baltimore, MD, United States",75.75,24.25
15,16,Salvador,Brazil,"Salvador, Brazil",75.69,24.31
16,17,Rosario,Argentina,"Rosario, Argentina",75.11,24.89
17,18,Memphis,United States,"Memphis, TN, United States",74.76,25.24
18,19,Detroit,United States,"Detroit, MI, United States",74.63,25.37
19,20,Rockhampton,Australia,"Rockhampton, Australia",73.51,26.49

In [70]:
crime_index_df3 = crime_index_df2.drop("city",axis=1)

In [71]:
crime_index_df3.head()

   rank           city2           country  crime_index  safety_index
0     1         Caracas         Venezuela        83.98         16.02
1     2        Pretoria      South Africa        81.98         18.02
2     3          Celaya            Mexico        81.80         18.20
3     4  San Pedro Sula          Honduras        80.87         19.13
4     5    Port Moresby  Papua New Guinea        80.71         19.29

In [72]:
crime_index_df3 = crime_index_df3.rename(columns={"city2":"city"})

In [73]:
crime_index_df3.tail(20)

     rank           city               country  crime_index  safety_index
433   434      Groningen           Netherlands        20.80         79.20
434   435          Tartu               Estonia        20.70         79.30
435   436          Arhus               Denmark        20.60         79.40
436   437         Muscat                  Oman        20.54         79.46
437   438          Basel           Switzerland        20.12         79.88
438   439         Oradea               Romania        19.82         80.18
439   440         Lugano           Switzerland        19.48         80.52
440   441      Trondheim                Norway        19.41         80.59
441   442      Eskisehir                Turkey        18.86         81.14
442   443         Munich               Germany        18.66         81.34
443   444           Bern           Switzerland        17.94         82.06
444   445         Zurich           Switzerland        17.26         82.74
445   446          Dubai  United Arab Emirates        16.30         83.70
446   447        Sharjah  United Arab Emirates        15.69         84.31
447   448          Ajman  United Arab Emirates        15.64         84.36
448   449    Quebec City                Canada        15.14         84.86
449   450         Taipei                Taiwan        15.05         84.95
450   451  San Sebastian                 Spain        14.86         85.14
451   452           Doha                 Qatar        13.96         86.04
452   453      Abu Dhabi  United Arab Emirates        11.67         88.33

In [74]:
crime_index_df3.head()

   rank            city           country  crime_index  safety_index
0     1         Caracas         Venezuela        83.98         16.02
1     2        Pretoria      South Africa        81.98         18.02
2     3          Celaya            Mexico        81.80         18.20
3     4  San Pedro Sula          Honduras        80.87         19.13
4     5    Port Moresby  Papua New Guinea        80.71         19.29

In [75]:
crime_index_df3.dropna()

     rank            city               country  crime_index  safety_index
0       1         Caracas             Venezuela        83.98         16.02
1       2        Pretoria          South Africa        81.98         18.02
2       3          Celaya                Mexico        81.80         18.20
3       4  San Pedro Sula              Honduras        80.87         19.13
4       5    Port Moresby      Papua New Guinea        80.71         19.29
..    ...             ...                   ...          ...           ...
448   449     Quebec City                Canada        15.14         84.86
449   450          Taipei                Taiwan        15.05         84.95
450   451   San Sebastian                 Spain        14.86         85.14
451   452            Doha                 Qatar        13.96         86.04
452   453       Abu Dhabi  United Arab Emirates        11.67         88.33

[453 rows x 5 columns]

In [76]:
crime_index_df3.head()

   rank            city           country  crime_index  safety_index
0     1         Caracas         Venezuela        83.98         16.02
1     2        Pretoria      South Africa        81.98         18.02
2     3          Celaya            Mexico        81.80         18.20
3     4  San Pedro Sula          Honduras        80.87         19.13
4     5    Port Moresby  Papua New Guinea        80.71         19.29

## We will only look at european nations

In [77]:
list_european_countries = ('Albania',
'Andorra',
'Belgium',
'Bosnia and Herzegovina',
'Bulgaria',
'Denmark',
'Germany',
'Estonia',
'Finland',
'France',
'Greece',
'Ireland',
'Iceland',
'Italy',
'Kazakhstan',
'Kosovo',
'Croatia',
'Latvia',
'Liechtenstein',
'Lithuania',
'Luxembourg',
'Malta',
'Moldova',
'Monaco',
'Montenegro',
'Netherlands',
'North Macedonia',
'Norway',
'Austria',
'Poland',
'Portugal',
'Romania',
'Russia',
'San Marino',
'Sweden',
'Switzerland',
'Serbia',
'Slovakia',
'Slovenia',
'Spain',
'Czech Republic',
'Turkey',
'Ukraine',
'Hungary',
'Vatican',
'United Kingdom',
'Belarus')

In [78]:
#convert tuple to list for list_european_countries

list_european_countries = list(list_european_countries)

In [79]:
european_crime_index_df = crime_index_df3.loc[crime_index_df3["country"].isin(list_european_countries)]

In [80]:
european_crime_index_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 170 entries, 25 to 450
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rank          170 non-null    int64
 1   city          170 non-null    object
 2   country       170 non-null    object
 3   crime_index   170 non-null    float64
 4   safety_index  170 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 8.0+ KB

In [81]:
european_crime_index_df.head(10)

    rank        city         country  crime_index  safety_index
25    26    Bradford  United Kingdom        71.24         28.76
37    38    Coventry  United Kingdom        68.35         31.65
46    47      Nantes          France        65.70         34.30
52    53      Almaty      Kazakhstan        64.17         35.83
58    59     Catania           Italy        63.51         36.49
63    64  Birmingham  United Kingdom        62.68         37.32
65    66   Marseille          France        62.51         37.49
78    79     Craiova         Romania        60.20         39.80
81    82      Naples           Italy        59.96         40.04
87    88        Nice          France        59.43         40.57

In [82]:
european_crime_index_df.tail(10)

     rank           city      country  crime_index  safety_index
435   436          Arhus      Denmark        20.60         79.40
437   438          Basel  Switzerland        20.12         79.88
438   439         Oradea      Romania        19.82         80.18
439   440         Lugano  Switzerland        19.48         80.52
440   441      Trondheim       Norway        19.41         80.59
441   442      Eskisehir       Turkey        18.86         81.14
442   443         Munich      Germany        18.66         81.34
443   444           Bern  Switzerland        17.94         82.06
444   445         Zurich  Switzerland        17.26         82.74
450   451  San Sebastian        Spain        14.86         85.14

In [83]:
#extract df to excel
european_crime_index_df.to_excel("european_crime_index.xlsx", sheet_name="european_crime_index")